In [78]:
import sqlite3
import pandas as pd

# source: https://www.sqlitetutorial.net/sqlite-sample-database/
conn = sqlite3.connect('chinook.db')
cursor = conn.cursor()

In [92]:
def run_query(filename):
    with open(filename, 'r') as file:
        queries = file.read()
    queries = queries.split(';')
    return pd.read_sql_query(queries[0], conn)

In [97]:
run_query('sales_totals.sql')

   EmployeeId FirstName  LastName  SalesTotal
0           1    Andrew     Adams         NaN
1           2     Nancy   Edwards         NaN
2           3      Jane   Peacock      833.04
3           4  Margaret      Park      775.40
4           5     Steve   Johnson      720.16
5           6   Michael  Mitchell         NaN
6           7    Robert      King         NaN
7           8     Laura  Callahan         NaN

In [3]:
cursor.close()
conn.close()